[
  {
    "title": "The Lion King",
    "release_date": "1994-06-24",
    "genre": "Animation",
    "description": "A young lion prince flees his kingdom after the death of his father, only to learn the true meaning of responsibility and bravery."
  },
  {
    "title": "Frozen",
    "release_date": "2013-11-27",
    "genre": "Animation",
    "description": "A fearless princess sets off on a journey to find her sister, whose icy powers have trapped their kingdom in eternal winter."
  },
  {
    "title": "Beauty and the Beast",
    "release_date": "1991-11-22",
    "genre": "Animation",
    "description": "A young woman discovers the kindness within a cursed beast as she learns to look beyond appearances."
  },
  {
    "title": "Aladdin",
    "release_date": "1992-11-25",
    "genre": "Animation",
    "description": "A street-smart young man discovers a magical genie and uses his wishes to win the heart of a princess."
  },
  {
    "title": "Toy Story",
    "release_date": "1995-11-22",
    "genre": "Animation",
    "description": "Toys come to life when humans aren't around, and a cowboy doll feels threatened by a flashy new space ranger."
  },
  {
    "title": "Moana",
    "release_date": "2016-11-23",
    "genre": "Animation",
    "description": "A spirited teenager sails across the ocean to save her island and discover her true destiny."
  },
  {
    "title": "Zootopia",
    "release_date": "2016-03-04",
    "genre": "Animation",
    "description": "A rookie bunny cop and a sly fox con artist uncover a conspiracy in a city of anthropomorphic animals."
  },
  {
    "title": "Mulan",
    "release_date": "1998-06-19",
    "genre": "Animation",
    "description": "A courageous young woman disguises herself as a man to take her father’s place in the army and save China."
  },
  {
    "title": "Finding Nemo",
    "release_date": "2003-05-30",
    "genre": "Animation",
    "description": "A timid clownfish braves the ocean to rescue his kidnapped son with the help of a forgetful friend."
  },
  {
    "title": "Tangled",
    "release_date": "2010-11-24",
    "genre": "Animation",
    "description": "A long-haired princess escapes her tower with a charming thief and discovers the world beyond."
  },
  {
    "title": "Coco",
    "release_date": "2017-11-22",
    "genre": "Animation",
    "description": "A boy who dreams of becoming a musician journeys to the Land of the Dead to uncover his family’s history."
  },
  {
    "title": "Big Hero 6",
    "release_date": "2014-11-07",
    "genre": "Animation",
    "description": "A tech prodigy forms a superhero team with his inflatable robot to uncover a dangerous plot."
  },
  {
    "title": "Ratatouille",
    "release_date": "2007-06-29",
    "genre": "Animation",
    "description": "A rat with a passion for cooking forms an unlikely partnership with a young kitchen worker in Paris."
  },
  {
    "title": "Up",
    "release_date": "2009-05-29",
    "genre": "Animation",
    "description": "An elderly man ties thousands of balloons to his house to fulfill a lifelong dream, accompanied by a persistent young scout."
  },
  {
    "title": "Wreck-It Ralph",
    "release_date": "2012-11-02",
    "genre": "Animation",
    "description": "A video game villain sets out to become a hero but ends up saving the arcade instead."
  },
  {
    "title": "The Incredibles",
    "release_date": "2004-11-05",
    "genre": "Animation",
    "description": "A family of undercover superheroes is forced into action to save the world from a new villain."
  },
  {
    "title": "Inside Out",
    "release_date": "2015-06-19",
    "genre": "Animation",
    "description": "The emotions inside a young girl's mind struggle to help her adjust to a major life change."
  },
  {
    "title": "Encanto",
    "release_date": "2021-11-24",
    "genre": "Animation",
    "description": "A girl born without magical powers must save her enchanted family and home when their magic begins to fade."
  },
  {
    "title": "Turning Red",
    "release_date": "2022-03-11",
    "genre": "Animation",
    "description": "A teenage girl starts turning into a giant red panda whenever she feels strong emotions."
  },
  {
    "title": "Brave",
    "release_date": "2012-06-22",
    "genre": "Animation",
    "description": "A headstrong princess defies tradition and must undo a curse she accidentally brings upon her family after a wish goes terribly wrong."
  }
]
